rte/src/test/resources/jmeter/testJMeter.yaml
modules:
  jmeter:
    path: .jmeter/4.0
    version: "4.0"
    properties:
      log_level: DEBUG
  console:
    disable: true

execution:
- concurrency: 1
  scenario: test3270
  iterations : 3
- concurrency: 1
  scenario: test5250
  iterations: 3
  
scenarios:
  test3270:
    script: RTESampler3270.jmx
  test5250:
    script: RTESampler5250.jmx


reporting:
- module: passfail
  criteria:
  - failures>0%