rte/src/test/resources/jmeter/testJMeterBZ.yaml
provisioning: cloud

modules:
  jmeter:
    version: "4.0"
    properties:
      log_level: DEBUG
  console:
    disable: true
  cloud:
    token: ${BZ_TOKEN}

execution:
- concurrency: 1
  scenario: test3270
  iterations : 3
  files:
  - lib
- concurrency: 1
  scenario: test5250
  iterations: 3
  files:
  - lib

scenarios:
  test3270:
    script: RTESampler3270.jmx
  test5250:
    script: RTESampler5250.jmx
    
reporting:
- module: passfail
  criteria:
  - failures>0%